Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC4502_F100/RTE_Device.h
//</e>

// <e> I2S3 (Inter-Integrated Sound) [Driver_SAI3]
// <i> Configuration settings for Driver_SAI3 in component ::Drivers:SAI
#define RTE_I2S3                      0

//   <o> I2S3_TX Pin <0=>P0_1
#define RTE_I2S3_TX_ID                0
#if    (RTE_I2S3_TX_ID == 0)
#define RTE_I2S3_TX_PORT              P0_1
#define RTE_I2S3_TX_AF                P0_1_AF_U1C1_DOUT0
#else
#error "Invalid I2S3_TX Pin Configuration!"
#endif

//   <o> I2S3_RX Pin <0=>P0_0
#define RTE_I2S3_RX_ID                0
#if    (RTE_I2S3_RX_ID == 0)
#define RTE_I2S3_RX_PORT              P0_0
#define RTE_I2S3_RX_INPUT             USIC1_C1_DX0_P0_0
#else
#error "Invalid I2S3_RX Pin Configuration!"
#endif

//   <o> I2S3_CLK OUTPUT Pin <0=>P0_10
#define RTE_I2S3_CLK_OUTPUT_ID                0
#if    (RTE_I2S3_CLK_OUTPUT_ID == 0)
#define RTE_I2S3_CLK_OUTPUT_PORT              P0_10
#define RTE_I2S3_CLK_AF                       P0_10_AF_U1C1_SCLKOUT
#else
#error "Invalid I2S3 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S3_CLK INPUT Pin <0=>P0_10 <2=>P4_0
#define RTE_I2S3_CLK_INPUT_ID                0
#if    (RTE_I2S3_CLK_INPUT_ID == 0)
#define RTE_I2S3_CLK_INPUT_PORT              P0_10
#define RTE_I2S3_CLK_INPUT                   USIC1_C1_DX1_P0_10
#elif  (RTE_I2S3_CLK_INPUT_ID == 2)
#define RTE_I2S3_CLK_INPUT_PORT              P4_0
#define RTE_I2S3_CLK_INPUT                   USIC1_C1_DX1_P4_0
#else
#error "Invalid I2S3 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2S3_WS OUTPUT Pin <0=>P0_9 <1=>P0_12
#define RTE_I2S3_WS_OUTPUT_ID                0
#if     (RTE_I2S3_WS_OUTPUT_ID == 0)
#define RTE_I2S3_WS_OUTPUT_PORT              P0_9
#define RTE_I2S3_WS_AF                       P0_9_AF_U1C1_SELO0
#elif   (RTE_I2S3_WS_OUTPUT_ID == 1)
#define RTE_I2S3_WS_OUTPUT_PORT              P0_12
#define RTE_I2S3_WS_AF                       P0_12_AF_U1C1_SELO0
#else
#error "Invalid I2S3_WS Output Pin Configuration!"
#endif

//   <o> I2S3_WS INPUT Pin <0=>P0_9 <1=>P0_12
#define RTE_I2S3_WS_INPUT_ID                 0
#if    (RTE_I2S3_WS_INPUT_ID == 0)
#define RTE_I2S3_WS_INPUT_PORT               P0_9
#define RTE_I2S3_WS_INPUT_ID_INPUT           USIC1_C1_DX2_P0_9
#elif  (RTE_I2S3_WS_INPUT_ID == 1)
#define RTE_I2S3_WS_INPUT_PORT               P0_12
#define RTE_I2S3_WS_INPUT_ID_INPUT           USIC1_C1_DX2_P0_12
#else
#error "Invalid I2S3_WS Input Pin Configuration!"
#endif

#define RTE_I2S3_MCLK_OUTPUT_ENABLE          0

//   <o> I2S3_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S3_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S3_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S3_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S3_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S3_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S3_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S3_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S3_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S3_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S3_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S3_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S3_RX FIFO SIZE Configuration!"
#endif

//   <o> I2S3_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S3_TX_FIFO_SIZE_ID                4
#if    (RTE_I2S3_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S3_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S3_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S3_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S3_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S3_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S3_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S3_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S3_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S3_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S3_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-63>
// <i> Defines priority of I2S events IRQ handling
// <i> Default: 63
#define RTE_I2S3_IRQ_PRIORITY  63

//</e>

#define RTE_I2S4                      0

// <e> I2S5 (Inter-Integrated Sound) [Driver_SAI5]
// <i> Configuration settings for Driver_SAI5 in component ::Drivers:SAI
#define RTE_I2S5                      0

//   <o> I2S5_TX Pin <0=>P3_5
#define RTE_I2S5_TX_ID                0
#if    (RTE_I2S5_TX_ID == 0)
#define RTE_I2S5_TX_PORT              P3_5
#define RTE_I2S5_TX_AF                P3_5_AF_U2C1_DOUT0
#else
#error "Invalid I2S5_TX Pin Configuration!"
#endif

//   <o> I2S5_RX Pin <0=>P3_5 <1=>P3_4 <2=>P4_0
#define RTE_I2S5_RX_ID                1
#if    (RTE_I2S5_RX_ID == 0)
#define RTE_I2S5_RX_PORT              P3_5
#define RTE_I2S5_RX_INPUT             USIC2_C1_DX0_P3_5
#elif  (RTE_I2S5_RX_ID == 1)
#define RTE_I2S5_RX_PORT              P3_4
#define RTE_I2S5_RX_INPUT             USIC2_C1_DX0_P3_4
#elif  (RTE_I2S5_RX_ID == 2)
#define RTE_I2S5_RX_PORT              P4_0
#define RTE_I2S5_RX_INPUT             USIC2_C1_DX0_P4_0
#else
#error "Invalid I2S5_RX Pin Configuration!"
#endif

//   <o> I2S5_CLK OUTPUT Pin <0=>P3_6
#define RTE_I2S5_CLK_OUTPUT_ID                0
#if    (RTE_I2S5_CLK_OUTPUT_ID == 0)
#define RTE_I2S5_CLK_OUTPUT_PORT              P3_6
#define RTE_I2S5_CLK_AF                       P3_6_AF_U2C1_SCLKOUT
#else
#error "Invalid I2S5 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S5_CLK INPUT Pin <1=>P3_6
#define RTE_I2S5_CLK_INPUT_ID                1
#if   (RTE_I2S5_CLK_INPUT_ID == 1)
#define RTE_I2S5_CLK_INPUT_PORT              P3_6
#define RTE_I2S5_CLK_INPUT                   USIC2_C1_DX1_P3_6
#else
#error "Invalid I2S5 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2S5_WS OUTPUT Pin <0=>P3_0 <1=>P4_1
#define RTE_I2S5_WS_OUTPUT_ID                0
#if     (RTE_I2S5_WS_OUTPUT_ID == 0)
#define RTE_I2S5_WS_OUTPUT_PORT              P3_0
#define RTE_I2S5_WS_AF                       P3_0_AF_U2C1_SELO0
#elif   (RTE_I2S5_WS_OUTPUT_ID == 1)
#define RTE_I2S5_WS_OUTPUT_PORT              P4_1
#define RTE_I2S5_WS_AF                       P4_1_AF_U2C1_SELO0
#else
#error "Invalid I2S5_WS Output Pin Configuration!"
#endif

//   <o> I2S5_WS INPUT Pin <0=>P4_1
#define RTE_I2S5_WS_INPUT_ID                 0
#if    (RTE_I2S5_WS_INPUT_ID == 0)
#define RTE_I2S5_WS_INPUT_PORT               P4_1
#define RTE_I2S5_WS_INPUT_ID_INPUT           USIC2_C1_DX2_P4_1
#else
#error "Invalid I2S5_WS Input Pin Configuration!"
#endif

